app/Controllers/Auth.php

public function login()
{
    helper(['form']);

    if ($this->session->get('isLoggedIn') == true) {
        return redirect()->to(base_url('dashboard'));
    }

    if ($this->request->getMethod() === 'POST') {
        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required'
        ];

        $messages = [
            'email' => [
                'required'    => 'Email is required.',
                'valid_email' => 'Please enter a valid email address.',
            ],
            'password' => [
                'required' => 'Password is required.'
            ]
        ];

        if ($this->validate($rules, $messages)) {
            $email = $this->request->getPost('email');
            $password = $this->request->getPost('password');

            $builder = $this->db->table('users');
            $user = $builder->where('email', $email)
                           ->get()
                           ->getRowArray();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@example.com'