app/Controllers/Course.php

        ];

        try {
            if ($enrollmentModel->insert($data)) {
---
INSERT INTO `enrollments` (`user_id`, `course_id`, `enrollment_date`) VALUES ('3', '8', '2025-10-13 18:47:30')